#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&После("ДобавитьКомандыПечати")
Процедура ИвЦСМ_ДобавитьКомандыПечати(КомандыПечати)

	// Счет на оплату (с расчётом аванса)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетНаОплатуАванса";
	КомандаПечати.Представление = НСтр("ru = 'Счет на оплату аванса (Ивановский ЦСМ)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюМППКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок       = 1;
	КонтрагентУчаствуетВЭДОВызовСервера.ДобавитьВКомандуПечатиПризнакОВыводеПредупрежденияЭДО(КомандаПечати);

КонецПроцедуры

&После("Печать")
Процедура ИвЦСМ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)

	// Счет на оплату (с расчётом аванса)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплатуАванса") Тогда
		ТаблицаСведенийСчетНаОплату = ПечатьТорговыхДокументов.ПолучитьТаблицуСведенийСчетаНаОплатуНового(МассивОбъектов, Ложь);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетНаОплатуАванса", "Счет на оплату аванса (Ивановский ЦСМ)",
			ПечатьТорговыхДокументов.ПечатьСчетаНаОплатуАванса(ТаблицаСведенийСчетНаОплату, ОбъектыПечати),, "Документ.СчетНаОплатуПокупателю.ПФ_MXL_СчетНаОплатуАванса");
		ПараметрыВывода.Вставить("ФормироватьЭД", Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли